{
  "backend/main.mo": "Main backend actor that includes the blob‑storage Mixin module.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Text file listing summaries for various frontend source files.",
  "frontend/CUSTOM_DOMAIN.md": "Guide explaining how to configure DNS and use a custom domain with the IC app.",
  "frontend/DEPLOYMENT.md": "Deployment instructions for local and mainnet environments with config and troubleshooting steps.",
  "frontend/index.css": "Tailwind and CSS variables defining light/dark theme colors and base styles.",
  "frontend/index.html": "Base HTML entry point loading the React app.",
  "frontend/src/App.tsx": "Main React layout composing header, hero, upload section, gallery, and footer.",
  "frontend/src/components/gallery/GalleryGrid.tsx": "Gallery grid that loads images, handles loading/error states, and displays items.",
  "frontend/src/components/gallery/GalleryItemCard.tsx": "Image card with thumbnail, download button, and delete workflow with confirmation.",
  "frontend/src/components/gallery/ImageUploader.tsx": "React component for selecting, previewing, validating, and uploading images with drag-and-drop and progress handling.",
  "frontend/src/components/Header.tsx": "Header showing logo/title and footer with attribution link.",
  "frontend/src/components/StorageRecoveryAlert.tsx": "Empty placeholder component file.",
  "frontend/src/config/runtime.ts": "Determines runtime canister ID and host settings based on environment for backend communication.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, handling login, logout, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Defines hooks for listing, uploading, and deleting images via the backend actor with react-query integration.",
  "frontend/src/index.css": "Tailwind base styles and custom theme variables for light/dark modes and gallery grid layout.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, typography, container queries, animations, and theme extensions.",
  "project_state.json": "Stores the project’s versioned state, high‑level description, and a list of implemented features for an IC-backed image gallery app. Contains metadata about authentication, actor management, runtime config, image CRUD hooks, and UI helpers."
}